bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/edc/ATSAMC21E16A.PIC
      <edc:SFRDef edc:_addr="0x42001CE4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TXBCIE" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="CFIE0" edc:desc="Cancellation Finished Interrupt Enable 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE1" edc:desc="Cancellation Finished Interrupt Enable 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE2" edc:desc="Cancellation Finished Interrupt Enable 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE3" edc:desc="Cancellation Finished Interrupt Enable 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE4" edc:desc="Cancellation Finished Interrupt Enable 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE5" edc:desc="Cancellation Finished Interrupt Enable 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE6" edc:desc="Cancellation Finished Interrupt Enable 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE7" edc:desc="Cancellation Finished Interrupt Enable 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE8" edc:desc="Cancellation Finished Interrupt Enable 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE9" edc:desc="Cancellation Finished Interrupt Enable 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE10" edc:desc="Cancellation Finished Interrupt Enable 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE11" edc:desc="Cancellation Finished Interrupt Enable 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE12" edc:desc="Cancellation Finished Interrupt Enable 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE13" edc:desc="Cancellation Finished Interrupt Enable 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE14" edc:desc="Cancellation Finished Interrupt Enable 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE15" edc:desc="Cancellation Finished Interrupt Enable 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE16" edc:desc="Cancellation Finished Interrupt Enable 16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE17" edc:desc="Cancellation Finished Interrupt Enable 17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE18" edc:desc="Cancellation Finished Interrupt Enable 18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE19" edc:desc="Cancellation Finished Interrupt Enable 19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE20" edc:desc="Cancellation Finished Interrupt Enable 20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE21" edc:desc="Cancellation Finished Interrupt Enable 21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE22" edc:desc="Cancellation Finished Interrupt Enable 22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE23" edc:desc="Cancellation Finished Interrupt Enable 23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE24" edc:desc="Cancellation Finished Interrupt Enable 24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE25" edc:desc="Cancellation Finished Interrupt Enable 25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE26" edc:desc="Cancellation Finished Interrupt Enable 26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE27" edc:desc="Cancellation Finished Interrupt Enable 27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE28" edc:desc="Cancellation Finished Interrupt Enable 28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE29" edc:desc="Cancellation Finished Interrupt Enable 29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE30" edc:desc="Cancellation Finished Interrupt Enable 30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE31" edc:desc="Cancellation Finished Interrupt Enable 31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42001CE8" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x42001CF0" edc:access="--nnnnnn--nnnnnnnnnnnnnnnnnnnnnn" edc:cname="TXEFC" edc:impl="0x3F3FFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="EFSA" edc:desc="Event FIFO Start Address" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="EFS" edc:desc="Event FIFO Size" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EFWM" edc:desc="Event FIFO Watermark" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42001CF4" edc:access="------rr---rrrrr---rrrrr--rrrrrr" edc:cname="TXEFS" edc:impl="0x31F1F3F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="EFFL" edc:desc="Event FIFO Fill Level" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EFGI" edc:desc="Event FIFO Get Index" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EFPI" edc:desc="Event FIFO Put Index" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EFF" edc:desc="Event FIFO Full" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFL" edc:desc="Tx Event FIFO Element Lost" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
